package com.test;

class Util {
	public static Employee generateEmployee() {
		Employee empl = new Employee();

		String names[] = { "Авдей", "Аверкий", "Авксентий", "Агафон", "Александр", "Алексей", "Альберт", "Альвиан",
				"Анатолий", "Андрей", "Антон", "Антонин", "Анфим", "Аристарх", "Аркадий", "Арсений", "Артём ", "Артур",
				"Архипп", "Афанасий", "Богдан", "Борис", "Вадим", "Валентин", "Валерий", "Валерьян", "Варлам",
				"Варфоломей ", "Василий", "Венедикт", "Вениамин ", "Викентий ", "Виктор ", "Виссарион", "Виталий",
				"Владимир ", "Владислав", "Владлен", "Влас", "Всеволод", "Вячеслав", "Гавриил", "Галактион", "Геласий",
				"Геннадий", "Георгий", "Герасим", "Герман", "Глеб", "Гордей", "Григорий", "Даниил ", "Демид ", "Демьян",
				"Денис", "Дмитрий", "Добрыня", "Донат", "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсей", "Евстафий",
				"Егор", "Емельян", "Еремей", "Ермолай", "Ефим", "Ждан", "Зиновий", "Иакинф", "Иван", "Игнатий", "Игорь",
				"Илья", "Иннокентий", "Ираклий ", "Ириней", "Исидор", "Иулиан", "Ким ", "Кирилл ", "Климент",
				"Кондрат ", "Константин", "Корнилий", "Кузьма", "Куприян", "Лаврентий", "Лев ", "Леонид", "Леонтий",
				"Лука ", "Лукий", "Лукьян", "Магистриан", "Макар", "Максим", "Марк ", "Мартын", "Матвей", "Мелентий",
				"Мирон", "Мирослав ", "Митрофан", "Михаил", "Мстислав", "Назар ", "Нестор", "Никанор", "Никита",
				"Никифор", "Николай", "Никон", "Олег", "Онисим", "Павел", "Пантелеймон", "Парфений", "Пётр", "Платон ",
				"Порфирий", "Потап", "Пров", "Прокопий", "Протасий", "Прохор", "Разумник", "Родион", "Роман ",
				"Ростислав", "Руслан", "Савва", "Савелий", "Самуил ", "Святополк", "Святослав", "Севастьян", "Семён",
				"Сергей", "Сильвестр", "Сильвестр ", "Созон", "Спиридон", "Станислав", "Степан", "Тарас", "Тимофей",
				"Тимур", "Тихон", "Тихон ", "Трифон", "Трофим", "Фаддей", "Фёдор", "Федосей", "Федот", "Феликс",
				"Феоктист", "Филат", "Филипп", "Фома", "Харитон", "Христофор", "Эдуард", "Эраст", "лиан", "Юрий",
				"Юстин", "Яков", "Якун", "Ярослав" };
		String lastNames[] = { "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков",
				"Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев",
				"Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров",
				"Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев",
				"Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров",
				"Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин",
				"Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев",
				"Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев",
				"Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов",
				"Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов",
				"Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков",
				"Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов",
				"Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев",
				"Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов",
				"Емельянов", "Горшков", "Чернов", "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин",
				"Назаров", "Лобанов", "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов",
				"Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов",
				"Моисеев", "Елисеев", "Кошелев", "Костин", "Горбачёв", "Орехов", "Ефремов", "Исаев", "Евдокимов",
				"Калашников", "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов",
				"Агафонов", "Муравьёв", "Ларионов", "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов", "Филатов",
				"Крюков", "Рогов", "Кулаков", "Терентьев", "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев",
				"Гришин", "Кононов", "Дементьев", "Ситников", "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов",
				"Носов", "Гуляев", "Шаров", "Устинов", "Вишняков", "Евсеев", "Лаврентьев", "Брагин", "Константинов",
				"Корнилов", "Авдеев", "Зыков", "Бирюков", "Шарапов", "Никонов", "Щукин", "Дьячков", "Одинцов",
				"Сазонов", "Якушев", "Красильников", "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков",
				"Бобылёв", "Доронин", "Белозёров", "Рожков", "Самсонов", "Мясников", "Лихачёв", "Буров", "Сысоев",
				"Фомичёв", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов", "Субботин", "Фокин", "Блохин",
				"Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров" };
		String companyNames[] = { "Google", "Yahoo!", "IBM", "SAP" };
		String jobPositions[] = { "Tester", "Developer", "Manager" };

		empl.setAge(18 + (int) (Math.random() * 40));
		empl.setName(names[((int) (Math.random() * names.length))]);
		empl.setLastName(lastNames[((int) (Math.random() * lastNames.length))]);
		empl.setCompanyName(companyNames[((int) (Math.random() * companyNames.length))]);
		int xPos = ((int) (Math.random() * jobPositions.length));
		empl.setJobPosition(jobPositions[xPos]);
		double salary = 0;
		if (xPos == 0) {
			salary = 1000 + (int) (Math.random() * 1000);
		} else if (xPos == 1) {
			salary = 2000 + (int) (Math.random() * 1000);
		} else {
			salary = 3000 + (int) (Math.random() * 1000);
		}

		empl.setSalary(salary);
		return empl;
	}

	public static Employee[] generateEmployees(int size) {
		Employee employees[] = new Employee[size];
		for (int i = 0; i < size; i++) {
			Employee e = generateEmployee();
			e.setUid(i + 1);
			employees[i] = e;
			System.out.println(e);
		}
		return employees;
	}

}

public class Employee {

	private long uid;
	private int age;
	private String name;
	private String lastName;
	private String companyName;
	private String jobPosition;
	private double salary;

	public Employee() {
		// System.out.println("Employee + 1");
	}

	public Employee(int age, String name, String lastName, String companyName, String jobPosition, double salary) {
		this();
		this.age = age;
		this.name = name;
		this.lastName = lastName;
		this.companyName = companyName;
		this.jobPosition = jobPosition;
		this.salary = salary;
	}

	public long getUid() {
		return uid;
	}

	public void setUid(long uid) {
		this.uid = uid;
	}

	public int getAge() {
		return age;
	}

	public void setAge(int age) {
		this.age = age;
	}

	public String getName() {
		return name;
	}

	public void setName(String name) {
		this.name = name;
	}

	public String getLastName() {
		return lastName;
	}

	public void setLastName(String lastName) {
		this.lastName = lastName;
	}

	public String getCompanyName() {
		return companyName;
	}

	public void setCompanyName(String companyName) {
		this.companyName = companyName;
	}

	public String getJobPosition() {
		return jobPosition;
	}

	public void setJobPosition(String jobPosition) {
		this.jobPosition = jobPosition;
	}

	public double getSalary() {
		return salary;
	}

	public void setSalary(double salary) {
		this.salary = salary;
	}

	@Override
	public String toString() {
		return "Employee [uid=" + uid + ", age=" + age + ", name=" + name + ", lastName=" + lastName + ", companyName="
				+ companyName + ", jobPosition=" + jobPosition + ", salary=" + salary + "]";
	}

}

class Tester {
	public static void main(String[] args) {
		Employee em1 = new Employee();
		em1.setAge(30);
		em1.setName("Alex");
		em1.setLastName("Ivanov");
		em1.setCompanyName("EPAM");
		em1.setJobPosition("Developer");
		em1.setSalary(5000);

		Employee em2 = new Employee(40, "Bob", "D", "IBM", "TESTER", 50000);

	}
}
